const azkar = [
{
category:"الصباح",
title:"آية الكرسي",
text:"الله لا إله إلا هو الحي القيوم لا تأخذه سنة ولا نوم..."
},
{
category:"الصباح",
title:"سيد الاستغفار",
text:"اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك..."
},
{
category:"المساء",
title:"رضيت بالله ربًا",
text:"رضيت بالله ربًا وبالإسلام دينًا وبمحمد ﷺ نبيًا."
},
{
category:"النوم",
title:"دعاء النوم",
text:"باسمك اللهم أموت وأحيا."
},
{
category:"بعد الصلاة",
title:"أستغفر الله",
text:"أستغفر الله (3 مرات)"
}
];
