// ==========================
// البيانات
// ==========================
const azkarData = [

  // ===== الصباح =====
  {
    id: 1,
    title: "ذكر الصباح",
    category: "الصباح",
    content: "أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شر ما في هذا اليوم وشر ما بعده، رب أعوذ بك من الكسل وسوء الكِبَر، رب أعوذ بك من عذاب في النار وعذاب في القبر.",
    count: 0
  },

  // ===== المساء =====
  {
    id: 2,
    title: "ذكر المساء",
    category: "المساء",
    content: "أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذه الليلة وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكِبَر، رب أعوذ بك من عذاب في النار وعذاب في القبر.",
    count: 0
  },

  // ===== النوم =====
  {
    id: 3,
    title: "دعاء النوم",
    category: "النوم",
    content: "باسمك ربي وضعت جنبي، وبك أرفعه، فإن أمسكت نفسي فارحمها، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين.",
    count: 0
  },

  // ===== الاستيقاظ =====
  {
    id: 4,
    title: "دعاء الاستيقاظ",
    category: "الاستيقاظ",
    content: "الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور.",
    count: 0
  },

  // ===== بعد الصلاة =====
  {
    id: 5,
    title: "الاستغفار بعد الصلاة",
    category: "بعد الصلاة",
    content: "أستغفر الله، أستغفر الله، أستغفر الله. اللهم أنت السلام، ومنك السلام، تباركت يا ذا الجلال والإكرام.",
    count: 0
  },

  {
    id: 6,
    title: "لا إله إلا الله وحده لا شريك له",
    category: "بعد الصلاة",
    content: "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد.",
    count: 0
  },

  {
    id: 7,
    title: "آية الكرسي",
    category: "بعد الصلاة",
    content: "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي ا
